<script setup lang="ts">
import type AboutData  from "@/interfaces/AboutData";

const aboutData : Array<AboutData> = [ //
  {
    title: 'EE4J',
    description: ' ایکلیپس اینترپرایس برای جاوا استاندارد هایی را در بنیاد ایکلیپس بر پایه جاکارتا ee برای پروژه های سطح بالا ایجاد میکند',
    image: "../assets/images/eclipse.png",
    url:'http://www.e4j.ir'
  },
  {
    title: 'JakartaEE',
    description: 'Jakarta EE یک جامعه جهانی از توسعه دهندگان، فروشندگان و شرکت های پیشرو را برای همکاری در پیشرفت فناوری جاوا سازمانی در فضای ابری گرد هم می آورد',
    image: "@/assets/images/jakarta.png",
    url:'http://www.jakartaee.ir'
  },
  {
    title: 'Microprofile',
    description: ' بهینه سازی جاوا اینترپرایس برای معماری میکروسرویس.',
    image: "assets/images/micro.png",
    url:'https://www.microprofile.io/'
  },
  {
    title: 'Quarkus',
    description: ' Quarkus ایجاد شد تا توسعه دهندگان جاوا را قادر به ایجاد برنامه های کاربردی برای دنیای مدرن و بومی ابری کند. ',
    image: "@/assets/images/quarkus.png",
    url:'http://www.quarkus.ir'
  },
  {
    title: 'Helidon',
    description: '          گروه کاربران جاوا ایران (IJUG) یک سازمان غیرانتفاعی با ماموریت ترویج یادگیری، تبادل اطلاعات و بحث در جامعه ما در مورد موضوعات مرتبط با زبان و پلتفرم برنامه نویسی جاوا است. IJUG جلسات ماهانه برگزار می کند و از همه کسانی که مایل به شرکت و مشارکت هستند استقبال می کند. ما می خواهیم یک کنفرانس سالانه توسعه دهندگان نرم افزار برگزار کنیم. لطفاً برنامه رویدادهای ما را برای اطلاعات در مورد جلسات ما ببینید. هدف IJUG (گروه کاربران جاوای ایران) همیشه کمک به مهندسان نرم افزار، فناوران و مدیران فنی در حوزه فارسی بوده است که در لبه های برتر بمانند. ما لبخند می زنیم و دوست داریم فکر کنیم که با ایفای نقش کوچکی در رشد این جامعه فنی پر جنب و جوش شرکت کرده ایم.',
    image: "1000",
    url:'http://www.helidon.ir'
  },
  {
    title: 'Spring',
    description: '          گروه کاربران جاوا ایران (IJUG) یک سازمان غیرانتفاعی با ماموریت ترویج یادگیری، تبادل اطلاعات و بحث در جامعه ما در مورد موضوعات مرتبط با زبان و پلتفرم برنامه نویسی جاوا است. IJUG جلسات ماهانه برگزار می کند و از همه کسانی که مایل به شرکت و مشارکت هستند استقبال می کند. ما می خواهیم یک کنفرانس سالانه توسعه دهندگان نرم افزار برگزار کنیم. لطفاً برنامه رویدادهای ما را برای اطلاعات در مورد جلسات ما ببینید. هدف IJUG (گروه کاربران جاوای ایران) همیشه کمک به مهندسان نرم افزار، فناوران و مدیران فنی در حوزه فارسی بوده است که در لبه های برتر بمانند. ما لبخند می زنیم و دوست داریم فکر کنیم که با ایفای نقش کوچکی در رشد این جامعه فنی پر جنب و جوش شرکت کرده ایم.',
    image: "1000",
    url:'https://www.spring.io/'
  },
  {
    title: 'Spring Boot',
    description: '          گروه کاربران جاوا ایران (IJUG) یک سازمان غیرانتفاعی با ماموریت ترویج یادگیری، تبادل اطلاعات و بحث در جامعه ما در مورد موضوعات مرتبط با زبان و پلتفرم برنامه نویسی جاوا است. IJUG جلسات ماهانه برگزار می کند و از همه کسانی که مایل به شرکت و مشارکت هستند استقبال می کند. ما می خواهیم یک کنفرانس سالانه توسعه دهندگان نرم افزار برگزار کنیم. لطفاً برنامه رویدادهای ما را برای اطلاعات در مورد جلسات ما ببینید. هدف IJUG (گروه کاربران جاوای ایران) همیشه کمک به مهندسان نرم افزار، فناوران و مدیران فنی در حوزه فارسی بوده است که در لبه های برتر بمانند. ما لبخند می زنیم و دوست داریم فکر کنیم که با ایفای نقش کوچکی در رشد این جامعه فنی پر جنب و جوش شرکت کرده ایم.',
    image: "1000",
    url:'https://www.spring.io/'
  },
  {
    title: 'Micronaut',
    description: '          گروه کاربران جاوا ایران (IJUG) یک سازمان غیرانتفاعی با ماموریت ترویج یادگیری، تبادل اطلاعات و بحث در جامعه ما در مورد موضوعات مرتبط با زبان و پلتفرم برنامه نویسی جاوا است. IJUG جلسات ماهانه برگزار می کند و از همه کسانی که مایل به شرکت و مشارکت هستند استقبال می کند. ما می خواهیم یک کنفرانس سالانه توسعه دهندگان نرم افزار برگزار کنیم. لطفاً برنامه رویدادهای ما را برای اطلاعات در مورد جلسات ما ببینید. هدف IJUG (گروه کاربران جاوای ایران) همیشه کمک به مهندسان نرم افزار، فناوران و مدیران فنی در حوزه فارسی بوده است که در لبه های برتر بمانند. ما لبخند می زنیم و دوست داریم فکر کنیم که با ایفای نقش کوچکی در رشد این جامعه فنی پر جنب و جوش شرکت کرده ایم.',
    image: "1000",
    url:'https://www.micronaut.io/'
  },
]
</script>
<template>

  <div class="flex  justify-center items-center max-w-6xl">
    <div class="row">
      <!-- Section Title -->
      <div class="section-title text-center wow fadeInUp">
        <Divider/>

        <h2>{{$t("about_header")}}</h2>
        <Divider/>
        <p  class="text-center font-tahoma">
          گروه کاربران جاوا ایران (IJUG) یک سازمان غیرانتفاعی با ماموریت ترویج یادگیری، تبادل اطلاعات و بحث در جامعه ما در مورد موضوعات مرتبط با زبان و پلتفرم برنامه نویسی جاوا است. IJUG جلسات ماهانه برگزار می کند و از همه کسانی که مایل به شرکت و مشارکت هستند استقبال می کند. ما می خواهیم یک کنفرانس سالانه توسعه دهندگان نرم افزار برگزار کنیم. لطفاً برنامه رویدادهای ما را برای اطلاعات در مورد جلسات ما ببینید. هدف IJUG (گروه کاربران جاوای ایران) همیشه کمک به مهندسان نرم افزار، فناوران و مدیران فنی در حوزه فارسی بوده است که در لبه های برتر بمانند. ما لبخند می زنیم و دوست داریم فکر کنیم که با ایفای نقش کوچکی در رشد این جامعه فنی پر جنب و جوش شرکت کرده ایم.
        </p>
      </div>

      <Divider/>
      <div  v-for="(about, index) in aboutData" :key="index">
        <Fieldset>
          <template #legend>
            <div  class="flex items-center gap-2 px-2">
              <a :href = about.url > <Avatar :image="about.image" shape="circle" /> </a>
              <span class="font-bold">{{ about.title }}</span>
            </div>
          </template>
          <p class="m-0">
            {{about.description}}
          </p>
        </Fieldset>
      </div>
    </div>
  </div>
</template>


<style scoped>

</style>
